In [12]:
! rm -rf test.db*
! ls -lrt

total 4
drwxr-xr-x 1 root root 4096 Feb 17 19:30 sample_data

In [13]:
# CREATING THE TABLE
import sqlite3

conn = sqlite3.connect('test.db', timeout=10)
print("Opened database successfully");

conn.execute('''
CREATE TABLE IF NOT EXISTS galleries (id integer, 
                      city text);''')

conn.execute('''
CREATE TABLE IF NOT EXISTS paintings (id integer, 
                      name text,
                      gallery_id int,
                      price integer);''')

conn.execute('''
CREATE TABLE IF NOT EXISTS sales_agents (id integer, 
                      last_name text,
                      first_name text,
                      gallery_id int,
                      agency_fee integer);''')

conn.execute('''
CREATE TABLE IF NOT EXISTS managers (id integer, 
                      gallery_id id);''')

conn.commit()

print("Table created successfully");

# conn.close()

Opened database successfully
Table created successfully

In [14]:
conn.execute("INSERT INTO galleries VALUES(1 , 'London');")
conn.execute("INSERT INTO galleries VALUES(2 , 'New York');")
conn.execute("INSERT INTO galleries VALUES(3 , 'Munich');")

In [15]:
cursor = conn.execute(''' SELECT *
                          FROM galleries
                          ''')

for row in cursor:
  print(row)

(1, 'London')
(2, 'New York')
(3, 'Munich')

In [16]:
conn.execute("INSERT INTO paintings VALUES(1,	'Patterns',	3,	5000);")
conn.execute("INSERT INTO paintings VALUES(2,	'Ringer',	1,	4500);")
conn.execute("INSERT INTO paintings VALUES(3,	'Gift',	1,	3200);")
conn.execute("INSERT INTO paintings VALUES(4,	'Violin Lessons',	2,	6700);")
conn.execute("INSERT INTO paintings VALUES(5,	'Curiosity',	2,	9800);")

In [17]:
cursor = conn.execute(''' SELECT *
                          FROM paintings
                          ''')

for row in cursor:
  print(row)

(1, 'Patterns', 3, 5000)
(2, 'Ringer', 1, 4500)
(3, 'Gift', 1, 3200)
(4, 'Violin Lessons', 2, 6700)
(5, 'Curiosity', 2, 9800)

In [18]:
conn.execute("INSERT INTO sales_agents VALUES(1,	'Brown',	'Denis',	2,	2250);")
conn.execute("INSERT INTO sales_agents VALUES(2,	'White',	'Kate',	3,	3120);")
conn.execute("INSERT INTO sales_agents VALUES(3,	'Black',	'Sarah',	2,	1640);")
conn.execute("INSERT INTO sales_agents VALUES(4,	'Smith',	'Helen',	1,	4500);")
conn.execute("INSERT INTO sales_agents VALUES(5,	'Stewart',	'Tom',	3,	2130);")

In [19]:
cursor = conn.execute(''' SELECT *
                          FROM sales_agents
                          ''')

for row in cursor:
  print(row)

(1, 'Brown', 'Denis', 2, 2250)
(2, 'White', 'Kate', 3, 3120)
(3, 'Black', 'Sarah', 2, 1640)
(4, 'Smith', 'Helen', 1, 4500)
(5, 'Stewart', 'Tom', 3, 2130)

In [20]:
conn.execute("INSERT INTO managers VALUES(1,	2);")
conn.execute("INSERT INTO managers VALUES(2,	3);")
conn.execute("INSERT INTO managers VALUES(4,	1);")

In [21]:
cursor = conn.execute(''' 
SELECT *
FROM managers
                          ''')

for row in cursor:
  print(row)

(1, 2)
(2, 3)
(4, 1)

In [26]:
# [EASY] Q1: Print all details of sales agents, who received a 
# higher than average agency_fee, along with the average agency_fee
# PATTERN: SINGLE ROW SUB-QUERY

cursor = conn.execute(''' 
SELECT *, (SELECT AVG(agency_fee) FROM sales_agents)
FROM sales_agents
WHERE agency_fee >
(SELECT AVG(agency_fee) FROM sales_agents);

                          ''')

for row in cursor:
  print(row)

(2, 'White', 'Kate', 3, 3120, 2728.0)
(4, 'Smith', 'Helen', 1, 4500, 2728.0)

In [28]:
# [MEDIUM] Q2. Find the second costliest painting without using LIMIT 


cursor = conn.execute(''' 
SELECT * from paintings WHERE price = (SELECT MAX(price) AS SecondCostliest 
FROM paintings
WHERE price <
(SELECT MAX(price) FROM paintings));
                          ''')

for row in cursor:
  print(row)

(4, 'Violin Lessons', 2, 6700)

In [29]:
# [EASY] Q3: calculate the average agency fee
# for those agents who are not managers.
# PATTERN: MULTI-ROW SUB_QUERIES
# TYpically used with IN, NOT IN, ANY, ALL, EXISTS, NOT EXISTS

cursor = conn.execute(''' 

SELECT AVG(agency_fee)
FROM sales_agents
WHERE id NOT IN (SELECT id
                 FROM managers);
                          ''')

for row in cursor:
  print(row)

(1885.0,)

In [30]:
# [EASY] Q4 Find the city and the number of paintings found in each of our galleries using sub-queries ONLY. Do NOT yses joins and group-bys.
# PATTERN: CORRELATED SUBQUERY
cursor = conn.execute(''' 

SELECT city,
 (SELECT count(*)
  FROM paintings p
  WHERE g.id = p.gallery_id) as total_paintings
FROM galleries g;
                          ''')

for row in cursor:
  print(row)

('London', 2)
('New York', 2)
('Munich', 1)

In [36]:
# Q5. [EASY-MEDIUM] Solve Q4 using JOINS & GROUPBY: typically more efficient
# PATTERN/STRATGEY: SEE THE PARTIAL RESULTS OF JOINS
cursor = conn.execute(''' 
SELECT g.city, COUNT(p.id)
FROM galleries g JOIN paintings p ON p.gallery_id = g.id GROUP BY g.city;
                          ''')

for row in cursor:
  print(row)

('London', 2)
('Munich', 1)
('New York', 2)

In [ ]:
#Q6. HOMEWORK [MEDIUM] Get information about those sales agents whose agency fee is equal or
# higher than the average fee for their gallery in which the sales_agent beloings to.
# HINT: Correlated sub-query
cursor = conn.execute(''' 

                          ''')

for row in cursor:
  print(row)

In [ ]:
# Good practice questions and solutions:
# Refer : Medium and Hard questions at https://leetcode.com/problemset/database/
# RefeR: https://www.studocu.com/in/document/marathwada-mitra-mandals-polytechnic/computer-science/leetcodesql-questions-with-solutions/32128690